# სერვერი არის კომპიუტერი (ან მოწყობილობა), რომელიც ინახავს მონაცემებს (ვებსაიტები, ფაილები, აპლიკაციები) და აწვდის მათ მომხმარებლებს ქსელის (ინტერნეტის) საშუალებით.
# RAM (Random Access Memory) არის მოწყობილობის დროებითი მეხსიერება.სერვერი (ან კომპიუტერი) RAM-ში ამუშავებს მიმდინარე პროცესებს და მონაცემებს სწრაფად.
# ინტერნეტი არის გლობალური ქსელი, რომელიც აერთებს მილიონობით კომპიუტერს ერთმანეთთან.ის არის ინფრასტრუქტურა, რომლითაც შესაძლებელია ინფორმაცია გადავცეთ ნებისმიერი სერვერს ან კომპიუტერს მსოფლიოს ნებისმიერ წერტილში.
# HTTP არის პროტოკოლი, ანუ წესების ნაკრები, რომლის მიხედვითაც ხდება ვებსაიტიდან ინფორმაციის გადაცემა შენს ბრაუზერთან.
# HTTPS არის უსაფრთხო ვერსია HTTP-ის.მონაცემები გადაცემისას დაშიფრულია, ამიტომ მესამე პირები ვერ შეძლებენ მის წაკითხვას.
# DNS არის "ინტერნეტის სატელეფონო წიგნი".როდესაც ვწერთ საიტის სახელს, DNS ეძებს მის შესაბამის IP-მისამართს და ეხმარება ბრაუზერს, დაუკავშირდეს სწორ სერვერს.
# ჰოსტინგი არის სერვერის სერვისი, რომელიც ქირაობ სერვერის ადგილს ვებსაიტისთვის.