
//7) შექმენით ერთი ფუნქცია რომელსაც გადაეცემა სამი პარამეტრი a, b, c პარამეტრი უნდა იყოს რიცხვი და უნდა იყოს კენტი თქვენმა ფუნქციამ უნდა შეამოწმოს არის თუ არა ამ პარამეტრების საბოლოო ჯამი 15 - ზე მეტი, ფუნქციაში შექმენით ერთი ცვლადი სახელად sum რომლის მნიშვნელობაც თავიდან იქნება 0 - ის ტოლი, შეამოწმეთ იმ შემთხვევაში თუ a პარამეტრი პროცენტული გაყოფით 2 - ზე არ უდრის 0 - ს მაგ შემთხვევაში sum ცვლადის მნიშვნელობა უნდა დააპლიუსოთ
//გააკეთეთ ეს შემოწმება ყველა პარამეტრზე საბოლოოდ კი შეამოწმეთ იმ შემთხვევაში თუ საბოლოო ჯამი sum მნიშვნელობა მეტია 15 ზე დაბეჭდეთ true სხვა შემთხვევაში კი გამოიტანეთ false - ი 

//8) შექმენით ერთი ფუნქცია გადაეცით მას ერთი პარამეტრი num, თქვენმა ფუნქციამ უნდა შეამოწმოს არის თუ არა კონკრეტული რიცხვი ლუწი თუ არის დააბრუნეთ რომ რიცხვი არის "Even" ლუწი სხვა შემთხვევაში კი დააბრუნეთ რომ "The Number Is Odd" ეს შემოწმება გააკეთეთ ternary operator - ის გამოყენებით, გამოიძახეთ ფუნქცია 4 ჯერ და გადაეცით მას პარამეტრად სხვადასხვა მნიშვნელობები

//9) შექმენით ორი ღილაკი heads tails ორივეს მიანიჭეთ უნკიალური ID შექმენით ერთი პარაგრაფი და მასაც მიანიჭეთ უნკიალური ID, მოიპოვეთ წვდომა ორივე ღილაკზე, იმ შემთხვევაში თუ მომხმარებელმა დააჭირა ხელი heads ღილაკს მაშინ paragraph element - ის ტექსტის შიგთავსი შეცვალეთ და გახადეთ heads - ი, თუ მომხმარებელმა დააჭირა ხელი tails ღილაკს მაშინ paragraph element - ის ტექსტის შიგთავსი შეცვალეთ და გახადეთ tails - ის ტოლი, მინიშნება გამოიყენეთ document.getElementById, addEventListener, მოუსმინეთ 'click' მოვლენას

let role = "moderator"; 
switch(role) {
    case "admin":
        console.log("you have full accses");
        break;
    case "moderator":
        console.log("you can manage the content");
        break;
    case "user":
        console.log("you can view the content");
        break;
    default:
        console.log("acses denied");
}
 
