//რეაქტი ფეისბუქმა გააკეთა ანუ მეტამ 
//ფრონტ ენდ ბიბლიოთეკა არის
//რეაქტით საიტი უფრო სწრაფად იტვირთება და უკეთეს დის საიტს
//რეაქტის მეშვეობით შეგიძლია ჯავა სკრიპტის დახმარებით დაწერო ინდექს ჰტმლს კოდი
//jsx ნიშნავს javascript syntax extention რომ ბოლომდე ვთქვათ
//რეაქტის კომპონენტებუხ არის და კომპონენტები საშუალებას გვაძლევს ჩვენი პროექტი დავშალოთ პატარა ნაწილებად, რომლებიც შემდგომში შეგვეძლება ჩვენს პროექტში სასურველ ადგილას გამოვიყენოთ
//მაგალითი:
function Welcome(props) {
  return <h1>Hello, {props.name}</h1>;
}