

#დეკლარაცია არის  ცვლადის გამოცხადება შეგვიძლია ის ვთქვათ რომ ეს აკეთებს ცვლადს .

#ინიციალიზაცია ცვლადს პირველ მნიშვნელობას ანიჭებს.ამით ცვლადი უკვე ინახავს გარკვეულ ინფორმაციას და ეს შეგვიძლია ვიხმაროთ.

#რეინიციალიზაცია არის ცვლადის მნიშვნელობის შეცვლა. ახალ მნიშვნელობას მისცემს და ძველს ჩაანაცვლებს ეს რეინიციალიზაცია.




#ეხლა მოდი 3-ჯერ  შევუცვალოთ ცვლადს მნიშვნელობა

name="luka"
name="nika"
name="giorgi"




print(name)

#ეხლა მოდი შევქმნათ 5 ცვლადი სადაც შევინახავთ რიცხვებს. და მერე დავპრინტოთ მათი ჯამი!

num1=4
num2=7
num3=8
num4=10
num5=4
sum=num1+num2+num3+num4+num5
print(sum)










#ეხლა მოდი გამოვითვალოთ მართკუთხედის პერიმეტრი. შევქმნი ორ ცვლადს length და width length=20 width=10!
length=20
width=10

print((length*2)+(width*2))
