//მოდი მოვიყვანოთ მაგალითი აი მაგალითად მეგობარს მოთხოვე აი კინოზე ინფორმაცია წიგნში და ის შეგპირდა რომ იპოვის
//თუ ვერ იპოვის აუცილებლად გამცემს პასუხს აი ეს არის ასინქროუმი და promise რომ გადვმოვთარგმნოტ ქართულში არის შეპირება
// ა სინქროუმი არ ელოდება მომდევნო კოდი არ ელოდება წინა ხაზს და ყველა ერთდროულად იბეჭდება

// აი მოდი პრომისს უკეთესად ავხსნი
// ჯავასკრიპტში ასინქრონულობის ერთ-ერთი მექანიზმია პრომისი
// პრომისი ნიშნავს დაპირებას როგორც წეღან ვთქვი რომ რაღაც ღირებულება ხელმისაწვდომი გახდება მომავალში