const me = {  //აქედან იწყება კოდი და ესე უკეთესად ჩანს ლისტისავით ვიდრე ისე რომ დაწერო
    name: luka, // აქ სახელია მერე ორი წერტილი იგივე ტოლობაა და სახელი ტოლია ლუკა
    lastname: gvelukashvili, // აქ გვარია და გვარი ტოლია გველუკაშვილი
    age: 13, // ეს ასაკი
    city: tbilisi, // ეს ქალაქ
    height: 178, // ეს მე დავამატე
    favouriteSport: football, // აქ კიდევ საყვარელი სპორტი ფეხბურტი
} // და კიდევ მასწავლებელმა თქვა რომ მძიმეები რომ არ იყოს არ იმუშავებს
// ობიექტი არის რასაც ვხედავთ და შეგვიძლია შევეხოთ