// 1) შექმენით ფუნქცია Sum, რომელიც არგუმენტად მიიღებს ორ რიცხვს და დააბრუნებს მათ ჯამს. ფუნქციას გაუწერეთ Default არგუმენტები. პასუხი დააბრუნეთ return-ით.

// 2) შექმენით ფუნქცია Substract, რომელიც არგუმენტად მიიღებს ორ რიცხვს და დააბრუნებს მათ სხვაობას. ფუნქციას გაუწერეთ Default არგუმენტები. პასუხი დააბრუნეთ return-ით.

// 3) შექმენით ფუნქცია Multiply, რომელიც არგუმენტად მიიღებს ორ რიცხვს და დააბრუნებს მათ ნამრავლს. ფუნქციას გაუწერეთ Default არგუმენტები. პასუხი დააბრუნეთ return-ით.

// 4) შექმენით ფუნქცია Divide, რომელიც არგუმენტად მიიღებს ორ რიცხვს და დააბრუნებს მათ განაყოფს. ფუნქციას გაუწერეთ Default არგუმენტები. პასუხი დააბრუნეთ return-ით.

// 5) შექმენით ფუნქცია, რომელიც მიიღებს ერთ რიცხვს და შეამოწმებს, არის თუ არა ის კენტი თუ ლუწი,შედეგი დაბეჭდეთ ეკრანზე

function sum(num1 = 5, num2 = 50){
    return num1 + num2
}

console.log(sum())
//------------------------------------------

function subtract(num3 = 10, num4 = 5){
    return num3 - num4
}

console.log(subtract())
//------------------------------------------

function Multiply(num5 = 10, num6 = 20){
    return num5 * num6
}

console.log(Multiply())
//-----------------------------------------

function divide(num7 = 10, num8 = 5){
    return num7 / num8
}

console.log(divide())
//----------------------------------------
function EvenOdd(number) {
    if (number % 2 === 0) {
        console.log(`${number} is Even`)
    }else {
        console.log(`${number} is Odd`)
    }
}