#compiler არის ის რაც თარგმნის კომპიუტერის კოდებს ეს რომ არ გვქონდეს 101010011 ეგრე უნდა დავწეროთ
#interpreter არის ის რაც კოდს კითულოს ყოველ ხაზზე ნელ ნელა
#compiled არის ინფორმაციას რომ იღებს სვადასხვა ადგილებიდან და ან წიგნში ჩასვას ან სიაში და ასე შემდეგ
#ამათ შორისნის არის განსხვავებ რომ სხვადასხვა მოქმედებებს აკეთებენ ერთი კოდს კითხულობს მეორეინფორმაციას იღებს სხვადასხვა 
#ადგილებიდან და მესამე კიდევ თარგმინს კომპიუტერულ კოდებს

# ცვლადი ინგლისურად არის variables ის გვეხმარება რამე სიტყვას მნიშვნელობა მივცეთ და გვეხმარება ბევრ რამეში