# # Level 110:
# ```py
# 1) შექმენით lambda ფუნქცია რომელიც იღებს ორ რიცხვს. ფუნქციამ უნდა დააბრუნოს პირველი რიცხვი აყვანილი მეორეს ხარისხში.

# 2) შექმენით lambda ფუნქცია რომელიც იღებს მართკუთხედის სიგრძეს და სიგანეს, დააბრუნეთ ამ მართკუთხედის პერიმეტრი.

# 3) შექმენით lambda ფუნქცია რომელიც იღებს სიტყვას და ამ სიტყვას აბრუნებს დიდ ასოებში (Uppercase).

# 4) შექმენით lambda ფუნქცია რომელიც რომელიც იღებს სიტყვას და აბრუნებს ამ სიტყვის სიგრძეს.
# ```

# power = (lambda x, y: x ** y) (2, 3)

# print(power)
# #-----------------------------------------------------
# per = lambda lenght, width: 2 * (lenght + width)

# print(per(5, 3))
# #-----------------------------------------------------
# to_uppercase = lambda word: word.upper()

# print(to_uppercase("Luka is the G.O.A.T"))
# #---------------------------------------------------
# word2_lenght = lambda word2: len(word2)

# print(word2_lenght("hello"))