let arr = [0, 1, 2, 3, 4];// ვქმნით მასივს ხუთი ელემენტით
let result = 0;// ვქმნით ცვლადს რესულტი სადაც დავაგროვებთ საბოლოო ჯამს

for (let i = 0; i < arr.length; i++) { //ვიწყებთ ციკლს მასივის ტავიდან ბოლომე
    let val = arr[i];// ვალ ცვლადში ვინახავთ მიმდინარე ელემენტს

    if (val && val % 2 === 0){// აქ მოწმდება ორი რამე არის თუ არა ვალ ტრუფი და არის თუ არა ლუწი
        result += val// ეს ხდება მხოლოდ მაშინ როდესაც რიცხვი არ არის 0 და თა ლუწია
    }else if (val || val === 0) {//ეს პირობა ყოველთვის შესრულდება ნებისმიერ რიცხვისთვის, რადგან თუ ვალ არ არის ჭეშმარიტი მეორე ნაწილი ვალ === 0 მაინც დააბრუნებს ტრუს
        result == val ? 1 : 10;//აქ გამოიყენება ტერნარი ოპერატორი, თუ ვალ არის ჭეშმარიტია დაამატე 1 თუ არა და 10
    }else {// სხვა შემთვევაში
        result += 100//აქ უბრალოდ რესულტს მიემატება 100
    }
}