// 1) ცვლადში შეინახეთ თქვენი ასაკი, შემდეგ კი დაწერეთ Conditional statement-ები:
// თუ ასაკი ნაკლებია 10-ზე დაბეჭდეთ 'child', თუ ასაკი მეტია 10-ზე მაგრამ ნაკლებია 18-ზე კონსოლში გამოიტანეთ 'Teen', ყველა სხვა შემთხვევაში Adult.

// 2) გამოიყენეთ Math.random() რათა დააგენერიროთ რენდომ რიცხვი 0-დან 100-მდე. თუ რიცხვი 50-ზე ნაკლები აღმოჩნდება გამოიტანეთ False, ხოლო თუ 50-ზე მეტი იქნება გამოიტანეთ False

//1
let age = 14;

if(age < 10){
    console.log("child")
}
else if(age > 10, age < 18){
    console.log("teen")
}
else{
    console.log(adult)
}
//-------------------------------------------------------
//2
let number = (Math.random() * 100)

if(number < 50){
    console.log(false)
}
else{
    console.log(true)
}

// 3) შექმენით ორი ცვლადი და შეინახეთ ნებისმიერი მნიშვნელობა. მკაცრი შედარების ოპერატორით შეადარეთ ტოლია თუ არა მათი მნიშვნელობები ერთმანეთს. შედეგი გამოიტანეთ კონსოლში

let number1 = 67;
let number2 = 67;
console.log(number1 === number2);
