// 1) ჩამოწრეთ ყველა ის იტერატორის მეთოდი რომლებიც თქვენ იცით, თითოეულის დანიშნულება ახსენით კომენტარების სახით

// 2) შექმენით მასივი სადაც შეინახავთ რიცხვებს 1 - 10 ჩათვლით, თქვენი დავალებაა, რომ console - ში გამოიტანეთ თოთო ელემენტი forEach - მეთოდის გამოყენებით

// 3) map - მეთოდის გამოყენებით numbers - მასივში არსებული თითო ელემენტი გადაამრავლეთ 2 - ზე, და გამოიტანეთ ახალი მასივი

// 4) findIndex - მეთოდის გამოყენებით console - ში გამოიტანეთ ისეთი რიცხვის index - რომელიც მეტია 3 - ზე

// 5) numbers მასივი გაფილტრეთ ისეთი რიცვებისგან რომლებიც მეტია 5 - ზე

numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

const num1 = numbers.forEach((num1) => console.log(num1))

console.log(num1)
const num2 = numbers.map((num) => num * 2);
    
console.log(num2)
const num3 = numbers.findIndex((num) => num > 3)

console.log(num3)

const num4 = numbers.filter((num) => num > 5)

console.log(num4)

//map ეს ფორ იჩს გავს ხოლო თვითონ ბრუნდება და არ ჭირდება ქონსოლ ლოგი
//filter ფილტრავს ამეებს და თვითონ ბრუნდება არაა საჭირო ქონსოლ ლოგი
//foreach ფორ ლუუპს გავს და მას console.log() სჭირდება
//findindex  შგვიძლია მიუთითოს თუ რანაირი ინდექსი გამოიტანოს