// 1) შექმენით ერთი მასივი შეინახეთ მასში 5 სახეობის ხილი push Method - ის გამოყენებით სიის ბოლოს დაამატეთ რამოდენიმე ელემენტი

// 2) შექმენით მასივი შეინახეთ მასში ფილმები, შექმენით ერთი ცვლადი removedElement და მასში შეინახეთ სიიდან ამოშლილი ბოლო ელემენტი ამისთვის გამოიყენეთ pop მეთოდი მიღებული (განახლებული) მასივი კი გამოიტანეთ console ში, კომენტარების სახით ახსენით აბრუნებს თუ არა pop მეთოდი წაშლილ მნიშვნელობას

// 3) მოიძიეთ დამატებითი მეთოდები მასივებზე და გააკეთეთ თითოეულზე 3 მაგალითი (მოიძიეთ ინფორმაცია მასივის შემდეგ მეთოდებზე slice, splice, shift, unshift, IndexOf)

// 4) კომენტარების სახით ახსენით თუ რა განსხვავებაა getElementById, getElementsByClassName, getElementByTagName - ს შორის 

// 5) paint - ის გამოყენებით თქვენი სიტყვებით ახსენით თუ რა არის DOM

// 6) შექმენით: 
// ორი პარაგრაფი
// ორი ღილაკი -- Change Text Content, Add innerHTML
// მოიპოვეთ მათზე წვდომა, როდესაც მომხმარებელი დააკლიკებს პირველ ღილაკს ხელს უნდა მოხდეს text - ის შიგთავსის შეცვლა, ხოლო როდესაც მომხმარებელი დააკლიკებს მეორე ღილაკს ხელს innerHTML - ის გამოყენებით უნდა ჩაამატოთ მეორე ელემენტში დამატებით ელემენტი <p><b>Value</b></p>, <p><strong></strong></p>, <p><i>Italic</i></</p> და ასე შემდეგ, კომენტარების სახით ახსენით თუ რა განსხვავებაა:
// div.innerHTML = `<p></p>`, div.innerHTML += `<p></p>` შორის

let fruits = ["apple", "banana", "watermellon", "kiwi", "mango"];
fruits.push("orange");
fruits.push("grape");
console.log(fruits);

// getelementbyid  წამოიღე ელემენტი იდს მეშვეობით
//getelementsbyclassname წამოიღე ელემენტები დოკუმენტიდან 
//კლასის მეშვეობით 
//getelementvytagname რამოიღე ელემენტი თეგის სახელით